In [8]:
import pandas as pd

In [9]:
df = pd.read_csv("stops.txt")

In [10]:
df.head()

   8220DB000002  Parnell Square West    2  53.35224436  -6.263723219
0  8220DB000003  Parnell Square West  3.0    53.352309     -6.263811
1  8220DB000004  Parnell Square West  4.0    53.352575     -6.264175
2  8220DB000006  Parnell Square West  6.0    53.352749     -6.264454
3  8220DB000007  Parnell Square West  7.0    53.352841     -6.264570
4  8220DB000008  Parnell Square West  8.0    53.353272     -6.265184

In [11]:
df.columns = ['id', 'name', 'num', 'lat', 'long']

In [12]:
df.head()

             id                 name  num        lat      long
0  8220DB000003  Parnell Square West  3.0  53.352309 -6.263811
1  8220DB000004  Parnell Square West  4.0  53.352575 -6.264175
2  8220DB000006  Parnell Square West  6.0  53.352749 -6.264454
3  8220DB000007  Parnell Square West  7.0  53.352841 -6.264570
4  8220DB000008  Parnell Square West  8.0  53.353272 -6.265184

In [15]:
df['num'].isna().sum()

2

In [16]:
df.loc[df['num'].isna()]

                id             name  num        lat      long
1578  8220DB007336  Cumberland Road  NaN  53.333728 -6.251337
1657  8220VIR07491   Virtual Stop 1  NaN  53.348530 -6.259879